app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 AND "users"."password" = $2 LIMIT $3  [["username", "abyicherinet@yahoo.com"], ["password", "a"], ["LIMIT", 1]]
---
  def login
    @login_user = user_params
    @user = User.find_by(username: @login_user['username'], password: @login_user['password'])

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "serpentz"], ["email", "email@email.com"], ["password", "password"], ["created_at", "2018-11-25 20:48:02.134696"], ["updated_at", "2018-11-25 20:48:02.134696"]]
---
  def create
    @user = User.new(user_params)


    if @user.save